In [1]:
import pandas as pd
from math import sqrt

In [5]:
oyuncular = {"boy": [177,178,179,181,182,185,187,189,190],"deneyim": [4,6,3,2,6,3,7,2,6], "maas": [12,18,15,16,24,20,28,24,32]}

In [6]:
df = pd.DataFrame(oyuncular)

In [7]:
df

   boy  deneyim  maas
0  177        4    12
1  178        6    18
2  179        3    15
3  181        2    16
4  182        6    24
5  185        3    20
6  187        7    28
7  189        2    24
8  190        6    32

In [9]:
df.maas.mean()

21.0

In [10]:
df.maas - df.maas.mean()

0    -9.0
1    -3.0
2    -6.0
3    -5.0
4     3.0
5    -1.0
6     7.0
7     3.0
8    11.0
Name: maas, dtype: float64

# Mean Model

In [14]:
(df.maas - df.maas.mean()).pow(2).sum()

340.0

# İlk Bölme

In [32]:
filt = (df.boy <=180)

In [33]:
df1 = df[filt]
df2 = df[~filt]

In [34]:
df1

   boy  deneyim  maas
0  177        4    12
1  178        6    18
2  179        3    15

In [35]:
df2

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  185        3    20
6  187        7    28
7  189        2    24
8  190        6    32

In [20]:
df1.maas.mean()

15.0

In [21]:
df2.maas.mean()

24.0

# Bölümden Sonraki Error

In [22]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df2.maas - df2.maas.mean()).pow(2).sum()

178.0

# İkinci Bölme

In [40]:
filt2 = (df2.boy<=185)

In [41]:
df3 = df2[filt2]
df4 = df2[~filt2]

In [42]:
df3

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  185        3    20

In [45]:
df3.maas.mean()

20.0

In [43]:
df4

   boy  deneyim  maas
6  187        7    28
7  189        2    24
8  190        6    32

In [46]:
df4.maas.mean()

28.0

# İkinci Bölme Error

In [47]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df3.maas - df3.maas.mean()).pow(2).sum() + (df4.maas - df4.maas.mean()).pow(2).sum()

82.0

# Üçüncü Bölme

In [48]:
filt3 = (df3.deneyim <=5)

In [49]:
df5 = df3[filt3]
df6 = df3[~filt3]

In [50]:
df5

   boy  deneyim  maas
3  181        2    16
5  185        3    20

In [51]:
df5.maas.mean()

18.0

In [52]:
df6.maas.mean()

24.0

# Üçüncü Bölme Error

In [53]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df5.maas - df5.maas.mean()).pow(2).sum() + (df4.maas - df4.maas.mean()).pow(2).sum() + (df6.maas - df6.maas.mean()).pow(2).sum()

58.0